package com.javarush.test.level05.lesson12.home04;

/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
*/

public class Solution
{
    public static void main(String[] args)
    {
        int day = 27;
        String month = "07";
        int year = 2015;
        System.out.println(day + " " + month + " " + year);
    }
}
